#SQL

##Task 1
Query all columns for a city in CITY with the ID 1661.

Input Format

The CITY table is described as follows: <br>
<img src = "https://s3.amazonaws.com/hr-challenge-images/8137/1449729804-f21d187d0f-CITY.jpg">

1.   List item
2.   List item

In [ ]:
  SELECT * FROM CITY
  WHERE ID = 1661

##Task 2
Query all columns for all American cities in CITY with populations larger than 100000. The CountryCode for America is USA.

Input Format<br>
<img src = "https://s3.amazonaws.com/hr-challenge-images/8137/1449729804-f21d187d0f-CITY.jpg">

In [ ]:
SELECT * FROM CITY
WHERE countrycode = "USA" and population >= 100000

##Task 3
Query all attributes of every Japanese city in the CITY table. The COUNTRYCODE for Japan is JPN.

Input Format:<br>
<img src = "https://s3.amazonaws.com/hr-challenge-images/8137/1449729804-f21d187d0f-CITY.jpg">

In [ ]:
SELECT * FROM CITY
WHERE countrycode = "JPN"

##Task 4
Query the names of all the Japanese cities in the CITY table. The COUNTRYCODE for Japan is JPN.

Input Format<br>
<img src = "https://s3.amazonaws.com/hr-challenge-images/8137/1449729804-f21d187d0f-CITY.jpg">

In [ ]:
SELECT name FROM CITY
WHERE countrycode = "JPN"

##Task 5
Query a list of CITY and STATE from the STATION table.

Input Format

The STATION table is described as follows:<br>
<img src = 'https://s3.amazonaws.com/hr-challenge-images/9336/1449345840-5f0a551030-Station.jpg'>

In [ ]:
SELECT CITY, STATE FROM STATION

##Task 6
Query a list of CITY names from STATION with even ID numbers only. You may print the results in any order, but must exclude duplicates from your answer.

Input Format

The STATION table is described as follows:<br>
<img src ="https://s3.amazonaws.com/hr-challenge-images/9336/1449345840-5f0a551030-Station.jpg">

In [ ]:
SELECT DISTINCT city FROM STATION
WHERE ID % 2 == 0

Let  be the number of CITY entries in STATION, and let  be the number of distinct CITY names in STATION; query the value of  from STATION. In other words, find the difference between the total number of CITY entries in the table and the number of distinct CITY entries in the table.

Input Format

The STATION table is described as follows:<br>
<img src = "https://s3.amazonaws.com/hr-challenge-images/9336/1449345840-5f0a551030-Station.jpg"><br>
where LAT_N is the northern latitude and LONG_W is the western longitude.

In [ ]:
SELECT
  (
    SELECT count(city) as val1 
    from station
    group by ID
  ) - (
        SELECT distinct count(city) as val1 
        from station
        group by ID
  ) as total_count

##Task 7
Query the two cities in STATION with the shortest and longest CITY names, as well as their respective lengths (i.e.: number of characters in the name). If there is more than one smallest or largest city, choose the one that comes first when ordered alphabetically.

Input Format

The STATION table is described as follows:<br>
  <img src = "https://s3.amazonaws.com/hr-challenge-images/9336/1449345840-5f0a551030-Station.jpg">

In [ ]:
select top 1 city, len(city) from station order by len(city) ASC, city ASC; 
select top 1 city, len(city) from station order by len(city) DESC, city ASC;

##Task 8
Query the list of CITY names starting with vowels (i.e., a, e, i, o, or u) from STATION. Your result cannot contain duplicates.

Input Format

The STATION table is described as follows: <br>
<img src = "https://s3.amazonaws.com/hr-challenge-images/9336/1449345840-5f0a551030-Station.jpg" >

In [ ]:
SELECT DISTINCT City FROM Station
WHERE City like "a%" or City like "e%" or City like "i%" or City like "o%" or City like "u%"

##Task 9
Query the list of CITY names ending with vowels (a, e, i, o, u) from STATION. Your result cannot contain duplicates.

Input Format

The STATION table is described as follows:<br>
<img src ="https://s3.amazonaws.com/hr-challenge-images/9336/1449345840-5f0a551030-Station.jpg">

In [ ]:
SELECT DISTINCT City FROM Station
WHERE City like "%a" or City like "%e" or City like "%i" or City like "%o" or City like "%u"

##Task 10
Query the list of CITY names from STATION which have vowels (i.e., a, e, i, o, and u) as both their first and last characters. Your result cannot contain duplicates.

Input Format

The STATION table is described as follows:<br>
<img src ="https://s3.amazonaws.com/hr-challenge-images/9336/1449345840-5f0a551030-Station.jpg">

In [ ]:
SELECT DISTINCT City FROM Station
WHERE City like "a%a" or City like "a%e" or City like "a%i" or City like "a%o" or City like "a%u" 
      or City like "e%a" or City like "e%e" or City like "e%i" or City like "e%o" or City like "e%u"
      or City like "i%a" or City like "i%e" or City like "i%i" or City like "i%o" or City like "i%u"
      or City like "u%a" or City like "u%e" or City like "u%i" or City like "u%o" or City like "u%u"

#Python

##Task 1
Task
Given an integer, perform the following conditional actions:

* If n is odd, print `Weird`
* If n is even and in the inclusive range of 2 to 5, print `Not Weird`
* If n is even and in the inclusive range of 6 to 20, print `Weird`
* If n is even and greater than 20, print `Not Weird`

Input Format

A single line containing a positive integer

Output Format

Print Weird if the number is weird; otherwise, print Not Weird.

In [ ]:
if __name__ == '__main__':
    n = int(input())
    # your code here
    if n % 2 == 1:
      print("Weird")
    elif 2 <= n <= 5:
      print("Not Weird") 
    elif 6 <= n <= 20:
      print("Weird")
    elif n > 20:
      print("Not Weird")

4
Not Weird

##Task 2
Read two integers from STDIN and print three lines where:
<ol>
  <li>The first line contains the sum of the two numbers.</li>
  <li>The second line contains the difference of the two numbers (first - second).</li>
  <li>The third line contains the product of the two numbers.</li>
</ol>

**Input Format**

The first line contains the first integer, **a**. The second line contains the second integer, **b**.

**Output Format**

Print the three lines as explained above.

In [1]:
if __name__ == '__main__':
    a = int(input())
    b = int(input())
    # your code here
    print("Sum of 2 numbers: ", a+b)
    print("\nDifference between 2 numbers: ", a-b)
    print("\nProduct of 2 numbers: ", a*b)

3
4
Sum of 2 numbers:  7

Difference between 2 numbers:  -1

Product of 2 numbers:  12

#Task 3
Task
Read an integer $N$. For all non-negative integers $i<N$ , print $i^{2}$. See the sample for details.

Input Format

The first and only line contains the integer, $N$ .

Constraints<br>
$1 \leq N \leq i$

Output Format

Print $N$ lines, one corresponding to each $i$.

In [11]:
if __name__ == '__main__':
    n = int(input())
    # your code here
    for i in range(0,n):
      print(i ** 2)

5
0
1
4
9
16

##Task 4
We add a Leap Day on February 29, almost every four years. The leap day is an extra, or intercalary day and we add it to the shortest month of the year, February.<br>

In the Gregorian calendar three criteria must be taken into account to identify leap years:
<ul>
<li>The year can be evenly divided by 4, is a leap year, unless:</li>
  <ul><li>The year can be evenly divided by 100, it is NOT a leap year, unless:</li>
    <ul><li>The year is also evenly divisible by 400. Then it is a leap year.</li></ul></ul></ul>
This means that in the Gregorian calendar, the years 2000 and 2400 are leap years, while 1800, 1900, 2100, 2200, 2300 and 2500 are NOT leap years.Source

**Task**<br>
<ul>
<li>You are given the year, and you have to write a function to check if the year is leap or not.</li>

  <li>Note that you have to complete the function and remaining code is given as template.</li>
  </ul>

**Input Format**

Read y, the year that needs to be checked.

**Constraints**<br>
$1900 \leq y \leq 10^{5}$

**Output Format**

Output is taken care of by the template. Your function must return a boolean value (True/False)

In [4]:
def is_leap(year):
  pass
  # your code here
  if (year % 4) == 0:
    if (year % 100) == 0:
      if (year % 400) == 0:
        print("{0} is a leap year".format(year))
      else:
        print("{0} is not a leap year".format(year))
    else:
      print("{0} is a leap year".format(year))
  else:
    print("{0} is not a leap year".format(year))

is_leap(2200)

2200 is not a leap year

##Task 5
Given the participants' score sheet for your University Sports Day, you are required to find the runner-up score. You are given $n$ scores. Store them in a list and find the score of the runner-up.

**Input Format**

The first line contains $n$ . The second line contains an array $A[]$ of $n$ integers each separated by a space.

**Constraints**<br>
$2   \leq n \leq 10 $<br>
$-100 \leq A[i] \leq 100 $

Output Format

Print the runner-up score.

In [9]:
if __name__ == '__main__':
  n = int(input())
  # your code here
  array = map(int, input().split())
  array = list(set(list(array)))
  len_array = len(array)
  array = sorted(array)
  print(array[len_array-2])

5
2 3 1 3 5
3